Repository: Ananda-collab/python-docs-id
Catalog: python-newest.library--atexit/*.po
Languages: id

source: :mod:`!atexit` --- Exit handlers
id: :mod:' !atexit" --- penangan keluar

source: The :mod:`atexit` module defines functions to register and unregister cleanup functions. Functions thus registered are automatically executed upon normal interpreter termination. :mod:`atexit` runs these functions in the *reverse* order in which they were registered; if you register ``A``, ``B``, and ``C``, at interpreter termination time they will be run in the order ``C``, ``B``, ``A``.
id: The :mod:'atexit' Modul ini mendefinisikan fungsi untuk mendaftarkan dan menghapus pendaftaranFungsi pembersihan. Fungsi yang terdaftar secara otomatis akan dieksekusisaat interpreter berakhir secara normal. :mod:`atexit` menjalankan fungsi-fungsi ini dalamurutan terbalik dari urutan pendaftarannya; jika Anda mendaftarkan ``A``,``B``, dan ``C``, pada saat interpreter berakhir, mereka akan dijalankan dalam urutan``C``, ``B``, ``A``.

source: **Note:** The functions registered via this module are not called when the program is killed by a signal not handled by Python, when a Python fatal internal error is detected, or when :func:`os._exit` is called.
id: **Catatan:** Fungsi yang didaftarkan melalui modul ini tidak akan dipanggil ketikaprogram dihentikan oleh sinyal yang ditangani oleh Python, ketika terjadi kesalahan internal fatal PythonKesalahan internal terdeteksi, atau ketika fungsi: 'os_exit' dipanggil

source: **Note:** The effect of registering or unregistering functions from within a cleanup function is undefined.
id: **Catatan:** Efek dari mendaftarkan atau menghapus pendaftaran fungsi dari dalam sebuahfungsi pembersihan tidak didefinisikan.

source: When used with C-API subinterpreters, registered functions are local to the interpreter they were registered in.
id: ketika menggunakan dengan subinterpreter C - API, fungsi yang terdaftar bersifat lokal padainterpreter tempat mereka didaftarkan.

source: Register *func* as a function to be executed at termination. Any optional arguments that are to be passed to *func* must be passed as arguments to :func:`register`. It is possible to register the same function and arguments more than once.
id: Daftarkan *func* sebagai fungsi yang akan dieksekusi saat program berakhir. Argumen opsional apapunyang akan diteruskan ke *func* harus diteruskan ke argumen kefunc:'register'. Dimungkinkan untuk mendaftarkan fungsi dan argumen yang sama lebih dari sekali.

source: At normal program termination (for instance, if :func:`sys.exit` is called or the main module's execution completes), all functions registered are called in last in, first out order. The assumption is that lower level modules will normally be imported before higher level modules and thus must be cleaned up later.
id: Pada penghentian program normal (misalnya, jika fungsi: 'sys.exit' dipanggilatau eksekusi modul utama selesai), semua fungsi yang terdaftar akan dipanggildalam urutan terakhir masuk, pertama keluar. Asumsinya adalah modul tingkat bawahbiasanya diimpor sebelum modul tingkat atas dan oleh karena itu harusdibersihkan kemudian.

source: If an exception is raised during execution of the exit handlers, a traceback is printed (unless :exc:`SystemExit` is raised) and the exception information is saved. After all exit handlers have had a chance to run, the last exception to be raised is re-raised.
id: Jika terjadi pengecualian selama eksekusi penanganan keluar, sebuah penelusuran balikakan dicetak (kecuali :exc:'SystemExit' terpicu) dan pengecualianinformasi disimpan. Setekah semua penanganan keluar memiliki kesempatan untuk dijalankanpengecualian terakhir yang terpicu akan dipicu kembali.

source: This function returns *func*, which makes it possible to use it as a decorator.
id: Fungsi ini mengembalikan *func*, yang memungkinkan penggunanya sebagaidekorator.

source: Starting new threads or calling :func:`os.fork` from a registered function can lead to race condition between the main Python runtime thread freeing thread states while internal :mod:`threading` routines or the new process try to use that state. This can lead to crashes rather than clean shutdown.
id: Memulai thread baru atau memanggil :func:'os.fork' dari fungsi yang terdaftarDapat menyebabkan kondisi race antara thread runtime Python utama yang membebaskanstatus thread sementara rutin internal :mod:'threading' atau proses baruberusaha menggunakan status tersebut. Hal ini dapat menyebabkan kegagalan daripada penutupan yang bersih.

source: Attempts to start a new thread or :func:`os.fork` a new process in a registered function now leads to :exc:`RuntimeError`.
id: Upaya untuk memulai thread baru atau :func:'os.fork' proses baru dalam sebuahfungsi yang terdaftar sekarang menyebabkan :exc:'RuntimeError'.

source: Remove *func* from the list of functions to be run at interpreter shutdown. :func:`unregister` silently does nothing if *func* was not previously registered. If *func* has been registered more than once, every occurrence of that function in the :mod:`atexit` call stack will be removed. Equality comparisons (``==``) are used internally during unregistration, so function references do not need to have matching identities.
id: Hapus *func* dari daftar fungsi yang akan dijalankan saat penutupan interpreter.:func:'unregister' tidak melakukan apa-apa secara diam-diam jika *func* belum pernahdidaftarkan sebelumnya. Jika *func* telah didaftarkan lebih dari sekali, setiap kemunculanfungsi tersebut dalam tumpukan panggilan :mod:'atexit' akan dihapusperbandingan kesamaan (''=='') digunakan secara internal selama proses penghapusan pendaftaran, sehingga referensi fungsitidak perlu memiliki identitas yang sama.

source: Module :mod:`readline`
id: Modul :mod:'readline'

source: Useful example of :mod:`atexit` to read and write :mod:`readline` history files.
id: Contoh berguna dari :mod:'atexit' untuk membaca dan menulis riwayat :mod:'readline'berkas

source: :mod:`atexit` Example
id: :mod:'atexit' contoh

source: The following simple example demonstrates how a module can initialize a counter from a file when it is imported and save the counter's updated value automatically when the program terminates without relying on the application making an explicit call into this module at termination. ::
id: Contoh sederhana berikut ini menunjukkan bagaimana sebuah modul dapat menginisialisaipenghitung dari berkas saat diimpor dan menyimpan nilai terbaru penghitung tersebutsecara otomatis saat program berakhir tanpa bergantung padaaplikasi yang melakukan panggilan eksplisit ke modul ini saat program berakhir. ::

source: try: with open('counterfile') as infile: _count = int(infile.read()) except FileNotFoundError: _count = 0 def incrcounter(n): global _count _count = _count + n def savecounter(): with open('counterfile', 'w') as outfile: outfile.write('%d' % _count) import atexit atexit.register(savecounter)
id: buka dengan('counterfile') sebagai infile:

source: Usage as a :term:`decorator`::
id: Penggunaan sebagai :term:'dekorator'::

source: This only works with functions that can be called without arguments.
id: Ini hanya berfungsi dengan fungsi yang dapat dipanggil tanpa argumen.
